1527. Patients With a Condition

Table: Patients

+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| patient_id   | int     |
| patient_name | varchar |
| conditions   | varchar |
+--------------+---------+
patient_id is the primary key (column with unique values) for this table.
'conditions' contains 0 or more code separated by spaces. 
This table contains information of the patients in the hospital.
 

Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Patients table:
+------------+--------------+--------------+
| patient_id | patient_name | conditions   |
+------------+--------------+--------------+
| 1          | Daniel       | YFEV COUGH   |
| 2          | Alice        |              |
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 |
| 5          | Alain        | DIAB201      |
+------------+--------------+--------------+
Output: 
+------------+--------------+--------------+
| patient_id | patient_name | conditions   |
+------------+--------------+--------------+
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 | 
+------------+--------------+--------------+
Explanation: Bob and George both have a condition that starts with DIAB1.

In [1]:
import pandas as pd

data = {"patient_id":[1,2,3,4,5], "patient_name":["Daniel","Alice","Bob","George","Alain"], "conditions":["YFEV COUGH","","DIAB100 MYOP","ACNE DIAB100","DIAB201"]}

Patients = pd.DataFrame(data)

Patients

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [11]:
Patients_type_1 = Patients.query('conditions.str.contains("DIAB1")') # we are try to create something similar to a like statement in SQL

# first we convert value to string and then use contains() to look for the letters

In [12]:
Patients_type_1

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

#### SQL

drop table  if exists patients;

create table patients(patient_id int, patient_name varchar(10), conditions varchar(20));

insert into patients values (1,'Daniel','YFEV COUGH');
insert into patients values (2,'Alice',null);
insert into patients values (3,'Bob','DIAB100 MYOP');
insert into patients values (4,'George','ACNE DIAB100');
insert into patients values (5,'Alain','DIAB201      ');


select * from patients;

select * from patients
where conditions like '% DIAB1%' or conditions like 'DIAB1%'